## Addiction population uncleaned data pre analysis

In [ ]:
# Data Exploration for Addiction Population Data

import pandas as pd

df = pd.read_csv("../data/raw/addiction_population_data.csv")
df.head()

,id,name,age,gender,country,city,education_level,employment_status,annual_income_usd,marital_status,...,attempts_to_quit_smoking,attempts_to_quit_drinking,has_health_issues,mental_health_status,exercise_frequency,diet_quality,sleep_hours,bmi,social_support,therapy_history
0,1,Michael Bates,66,Other,Yemen,Martinmouth,Secondary,Student,45595,Married,...,6,2,True,Good,Daily,Average,5.6,22.4,NaN,Current
1,2,Brian Thompson,29,Male,Saudi Arabia,Harperhaven,Primary,Self-Employed,145842,Single,...,1,6,False,Poor,Weekly,Good,6.7,24.1,Moderate,NaN
2,3,Steven Little,75,Male,Togo,Chanport,Postgraduate,Unemployed,162480,Single,...,9,9,True,Good,Never,Good,6.2,22.2,Weak,NaN
3,4,Michael Mathews,35,Other,Togo,North Cory,University,Unemployed,16023,In a relationship,...,5,7,False,Average,Daily,Good,7.2,25.5,Moderate,Current
4,5,Nicholas Sanchez,38,Female,Morocco,Danielberg,College,Self-Employed,62933,In a relationship,...,4,7,True,Poor,Weekly,Good,8.5,31.2,Weak,Past

In [6]:
# Check dataset shape & info

print("Shape:", df.shape)
df.info()

Shape: (3000, 25)
<class 'pandas.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 25 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   id                         3000 non-null   int64
 1   name                       3000 non-null   str
 2   age                        3000 non-null   int64
 3   gender                     3000 non-null   str
 4   country                    3000 non-null   str
 5   city                       3000 non-null   str
 6   education_level            2580 non-null   str
 7   employment_status          3000 non-null   str
 8   annual_income_usd          3000 non-null   int64
 9   marital_status             3000 non-null   str
 10  children_count             3000 non-null   int64
 11  smokes_per_day             3000 non-null   int64
 12  drinks_per_week            3000 non-null   int64
 13  age_started_smoking        3000 non-null   int64
 14  age_started_drinking       3000 non-null   int64
 15  attempts_to_quit_smoking   3000 non-null   int64
 16  attempts_to_quit_drinking  3000 non-null   int64
 17  has_health_issues          3000 non-null   bool
 18  mental_health_status       3000 non-null   str
 19  exercise_frequency         3000 non-null   str
 20  diet_quality               3000 non-null   str
 21  sleep_hours                3000 non-null   float64
 22  bmi                        3000 non-null   float64
 23  social_support             2247 non-null   str
 24  therapy_history            1986 non-null   str
dtypes: bool(1), float64(2), int64(10), str(12)
memory usage: 565.6 KB

In [7]:
# Check missing (null) values

df.isnull().sum().sort_values(ascending=False)

therapy_history              1014
social_support                753
education_level               420
id                              0
name                            0
country                         0
city                            0
gender                          0
age                             0
annual_income_usd               0
employment_status               0
marital_status                  0
children_count                  0
age_started_smoking             0
age_started_drinking            0
smokes_per_day                  0
drinks_per_week                 0
attempts_to_quit_drinking       0
attempts_to_quit_smoking        0
has_health_issues               0
mental_health_status            0
diet_quality                    0
exercise_frequency              0
bmi                             0
sleep_hours                     0
dtype: int64

In [ ]:
# To see percentage:
(df.isnull().mean() * 100).sort_values(ascending=False)

therapy_history              33.8
social_support               25.1
education_level              14.0
id                            0.0
name                          0.0
country                       0.0
city                          0.0
gender                        0.0
age                           0.0
annual_income_usd             0.0
employment_status             0.0
marital_status                0.0
children_count                0.0
age_started_smoking           0.0
age_started_drinking          0.0
smokes_per_day                0.0
drinks_per_week               0.0
attempts_to_quit_drinking     0.0
attempts_to_quit_smoking      0.0
has_health_issues             0.0
mental_health_status          0.0
diet_quality                  0.0
exercise_frequency            0.0
bmi                           0.0
sleep_hours                   0.0
dtype: float64

In [9]:
# Check duplicates

df.duplicated().sum()

np.int64(0)

In [11]:
# Check empty strings

(df == "").sum()

id                           0
name                         0
age                          0
gender                       0
country                      0
city                         0
education_level              0
employment_status            0
annual_income_usd            0
marital_status               0
children_count               0
smokes_per_day               0
drinks_per_week              0
age_started_smoking          0
age_started_drinking         0
attempts_to_quit_smoking     0
attempts_to_quit_drinking    0
has_health_issues            0
mental_health_status         0
exercise_frequency           0
diet_quality                 0
sleep_hours                  0
bmi                          0
social_support               0
therapy_history              0
dtype: int64

In [13]:
# Check outliers (numerical columns)

df.describe()

,id,age,annual_income_usd,children_count,smokes_per_day,drinks_per_week,age_started_smoking,age_started_drinking,attempts_to_quit_smoking,attempts_to_quit_drinking,sleep_hours,bmi
count,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000
mean,1500.500000,46.654333,98904.178000,2.453667,10.034000,5.002333,24.365667,24.525333,4.440333,4.542000,6.470400,25.170133
std,866.169729,18.740880,57288.035963,1.704354,3.108386,2.214037,8.707309,8.679121,2.835334,2.866992,1.495878,5.013345
min,1.000000,15.000000,560.000000,0.000000,2.000000,0.000000,10.000000,10.000000,0.000000,0.000000,1.500000,9.100000
25%,750.750000,31.000000,49336.000000,1.000000,8.000000,3.000000,17.000000,17.000000,2.000000,2.000000,5.475000,21.900000
50%,1500.500000,47.000000,98616.500000,2.000000,10.000000,5.000000,24.000000,25.000000,4.000000,5.000000,6.500000,25.200000
75%,2250.250000,63.000000,148622.750000,4.000000,12.000000,6.000000,32.000000,32.000000,7.000000,7.000000,7.500000,28.400000
max,3000.000000,79.000000,199951.000000,5.000000,21.000000,14.000000,39.000000,39.000000,9.000000,9.000000,12.600000,43.900000

In [ ]:
# IQR method

numeric_cols = df.select_dtypes(include="number").columns

for col in numeric_cols:
    Q1 = df[col].quantile(0.25)
    Q3 = df[col].quantile(0.75)
    IQR = Q3 - Q1

    lower = Q1 - 1.5 * IQR
    upper = Q3 + 1.5 * IQR

    outliers = ((df[col] < lower) | (df[col] > upper)).sum()
    print(f"{col}: {outliers} outliers")

id: 0 outliers
age: 0 outliers
annual_income_usd: 0 outliers
children_count: 0 outliers
smokes_per_day: 15 outliers
drinks_per_week: 42 outliers
age_started_smoking: 0 outliers
age_started_drinking: 0 outliers
attempts_to_quit_smoking: 0 outliers
attempts_to_quit_drinking: 0 outliers
sleep_hours: 22 outliers
bmi: 27 outliers

In [17]:
# Check value consistency (categorical)

for col in df.select_dtypes(include="object").columns:
    print(col, df[col].nunique())
    print(df[col].unique())
    print("------")

name 2944
<StringArray>
[    'Michael Bates',    'Brian Thompson',     'Steven Little',
   'Michael Mathews',  'Nicholas Sanchez',    'Carrie Sellers',
  'Jessica Riley MD',    'Walter Tran MD',    'Melanie Walker',
      'Carl Mathews',
 ...
        'Renee Rios', 'Michael Christian',       'Amanda Ryan',
        'Andrew Lin',    'Robert Stewart',     'Mary Bartlett',
      'Beth Sanchez',       'Megan Duffy',    'Jeffery Lawson',
      'Kathryn Gray']
Length: 2944, dtype: str
------
gender 3
<StringArray>
['Other', 'Male', 'Female']
Length: 3, dtype: str
------
country 243
<StringArray>
[                               'Yemen',
                         'Saudi Arabia',
                                 'Togo',
                              'Morocco',
                              'Belgium',
                'Saint Kitts and Nevis',
                    'Equatorial Guinea',
                         'Burkina Faso',
                             'Barbados',
                                'Benin',
 ...
                           'Seychelles',
                                'Macao',
                           'Costa Rica',
                         'Cook Islands',
                               'Uganda',
                                'Egypt',
 'United States Minor Outlying Islands',
                              'Romania',
             'United States of America',
                             'Botswana']
Length: 243, dtype: str
------
city 2675
<StringArray>
[        'Martinmouth',         'Harperhaven',            'Chanport',
          'North Cory',          'Danielberg',         'West Arthur',
     'Christopherstad',           'Silvaberg',          'Brandystad',
         'Roseborough',
 ...
           'Cookebury',          'Petersport', 'South Elizabethstad',
           'New Bruce',            'New Ryan',       'Port Kimberly',
           'Smithbury',           'Clinebury',         'Colleenport',
          'Turnertown']
Length: 2675, dtype: str
------
education_level 6
<StringArray>
[   'Secondary',      'Primary', 'Postgraduate',   'University',
      'College',  'High School',            nan]
Length: 7, dtype: str
------
employment_status 5
<StringArray>
['Student', 'Self-Employed', 'Unemployed', 'Employed', 'Retired']
Length: 5, dtype: str
------
marital_status 5
<StringArray>
['Married', 'Single', 'In a relationship', 'Widowed', 'Divorced']
Length: 5, dtype: str
------
mental_health_status 3
<StringArray>
['Good', 'Poor', 'Average']
Length: 3, dtype: str
------
exercise_frequency 4
<StringArray>
['Daily', 'Weekly', 'Never', 'Rarely']
Length: 4, dtype: str
------
diet_quality 3
<StringArray>
['Average', 'Good', 'Poor']
Length: 3, dtype: str
------
social_support 3
<StringArray>
[nan, 'Moderate', 'Weak', 'Strong']
Length: 4, dtype: str
------
therapy_history 2
<StringArray>
['Current', nan, 'Past']
Length: 3, dtype: str
------

C:\Users\User\AppData\Local\Temp\ipykernel_9164\1640501185.py:3: Pandas4Warning: For backward compatibility, 'str' dtypes are included by select_dtypes when 'object' dtype is specified. This behavior is deprecated and will be removed in a future version. Explicitly pass 'str' to `include` to select them, or to `exclude` to remove them and silence this warning.
See https://pandas.pydata.org/docs/user_guide/migration-3-strings.html#string-migration-select-dtypes for details on how to write code that works with pandas 2 and 3.
  for col in df.select_dtypes(include="object").columns:

In [ ]:
# Range checks

df["age"].min(), df["age"].max()
df["sleep_hours"].describe()
df["bmi"].describe()

count    3000.000000
mean       25.170133
std         5.013345
min         9.100000
25%        21.900000
50%        25.200000
75%        28.400000
max        43.900000
Name: bmi, dtype: float64

In [ ]:
# Logical checks

df[df["age_started_smoking"] > df["age"]]

,id,name,age,gender,country,city,education_level,employment_status,annual_income_usd,marital_status,...,attempts_to_quit_smoking,attempts_to_quit_drinking,has_health_issues,mental_health_status,exercise_frequency,diet_quality,sleep_hours,bmi,social_support,therapy_history
3,4,Michael Mathews,35,Other,Togo,North Cory,University,Unemployed,16023,In a relationship,...,5,7,False,Average,Daily,Good,7.2,25.5,Moderate,Current
17,18,Brian Brown,36,Male,Ghana,East Deborah,Primary,Student,169298,In a relationship,...,8,1,False,Poor,Rarely,Good,7.0,27.0,Moderate,Current
22,23,Chad Bennett,29,Other,Cuba,Kirbytown,College,Self-Employed,163824,Single,...,2,0,False,Poor,Daily,Average,7.2,36.6,NaN,NaN
30,31,Steven Austin,17,Female,Canada,Nealside,High School,Self-Employed,189299,In a relationship,...,6,7,True,Poor,Daily,Poor,5.7,28.6,Weak,Current
36,37,Darrell Thompson,18,Male,Uzbekistan,Port Bryceport,Postgraduate,Employed,152038,In a relationship,...,6,9,True,Poor,Weekly,Good,5.3,21.2,Moderate,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2985,2986,Yvette Lee,19,Other,Holy See (Vatican City State),Stokesmouth,Secondary,Unemployed,3614,Divorced,...,3,4,True,Average,Daily,Good,3.8,21.7,Moderate,Current
2987,2988,Kristina Mercado,18,Other,Kiribati,Ballardmouth,NaN,Unemployed,50268,Divorced,...,4,0,False,Poor,Weekly,Average,8.2,22.1,Strong,NaN
2990,2991,Renee Rios,22,Other,Hungary,Cookebury,College,Unemployed,187137,Divorced,...,6,3,True,Poor,Daily,Average,5.7,22.2,Strong,NaN
2995,2996,Mary Bartlett,29,Other,Macedonia,Port Kimberly,Postgraduate,Employed,118269,Single,...,9,1,True,Poor,Never,Average,6.6,27.4,Moderate,Current
2997,2998,Megan Duffy,15,Male,Falkland Islands (Malvinas),Clinebury,College,Retired,167501,Widowed,...,1,8,True,Poor,Rarely,Poor,6.6,23.5,Moderate,Past

In [ ]:
df[df["age_started_drinking"] > df["age"]]

,id,name,age,gender,country,city,education_level,employment_status,annual_income_usd,marital_status,...,attempts_to_quit_smoking,attempts_to_quit_drinking,has_health_issues,mental_health_status,exercise_frequency,diet_quality,sleep_hours,bmi,social_support,therapy_history
5,6,Carrie Sellers,17,Male,Belgium,West Arthur,Secondary,Employed,178640,Single,...,2,3,True,Good,Never,Average,6.4,29.3,Weak,Past
8,9,Melanie Walker,16,Other,Burkina Faso,Brandystad,Postgraduate,Retired,85495,Divorced,...,6,5,False,Good,Weekly,Good,4.6,24.6,NaN,NaN
11,12,Michael Parker DDS,16,Other,Benin,North Tiffanyhaven,Secondary,Retired,123308,Divorced,...,6,2,False,Average,Weekly,Average,6.4,30.2,Weak,Past
22,23,Chad Bennett,29,Other,Cuba,Kirbytown,College,Self-Employed,163824,Single,...,2,0,False,Poor,Daily,Average,7.2,36.6,NaN,NaN
32,33,Annette Edwards,21,Female,British Virgin Islands,East Wesleyville,Secondary,Unemployed,90953,In a relationship,...,7,9,False,Average,Never,Average,4.8,24.5,Weak,Past
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2986,2987,Linda Rodriguez,35,Other,Croatia,Thompsonport,College,Unemployed,27002,Divorced,...,5,1,True,Average,Weekly,Average,5.3,24.5,Strong,Current
2987,2988,Kristina Mercado,18,Other,Kiribati,Ballardmouth,NaN,Unemployed,50268,Divorced,...,4,0,False,Poor,Weekly,Average,8.2,22.1,Strong,NaN
2990,2991,Renee Rios,22,Other,Hungary,Cookebury,College,Unemployed,187137,Divorced,...,6,3,True,Poor,Daily,Average,5.7,22.2,Strong,NaN
2992,2993,Amanda Ryan,33,Female,Cyprus,South Elizabethstad,University,Employed,108755,Widowed,...,2,6,True,Poor,Rarely,Average,8.7,15.7,NaN,NaN
2997,2998,Megan Duffy,15,Male,Falkland Islands (Malvinas),Clinebury,College,Retired,167501,Widowed,...,1,8,True,Poor,Rarely,Poor,6.6,23.5,Moderate,Past

# Data quality issues identified:
# 1. Missing values in 'age_started_smoking' and 'age_started_drinking' (potentially non-smokers/drinkers)
# 2. Outliers in 'age', 'sleep_hours', and 'bmi'
# 3. Logical inconsistencies where 'age_started_smoking' and 'age_started_drinking' are greater than 'age'
# Next steps: Handle missing values, address outliers, and correct logical inconsistencies before modeling.

In [21]:
# Data quality report cell

print("Shape:", df.shape)
print("Missing values:", df.isnull().sum().sum())
print("Duplicates:", df.duplicated().sum())

Shape: (3000, 25)
Missing values: 2187
Duplicates: 0